package com.rus.VsakoRazno.rus.ru.bu;

/**
 * Created by User on 023 23.12.16.
 */
public class Opisanie_OPP {

    String nasledovanie = "Наследование - это консруирование нового класса на основе уже существуещего.";

    String primenenienasledovanie = "Применяется для исключения дублирования кода в Классах котрое очень похожи. И в принципе являюся аналогичными друг друга" +
            "И заимствовать код друг у  друга. Использовать наследование надо очень осторожно и обдуманно. Использовать" +
            "Правило класс Является этим классом или только содержит эти методы(код) этого класса ";

    String Инкопсуляция = "Инкопсуляция - это способ скрыть сложное устройство класса с целью упростить использование " +
            "или обезопасить от неправельного использования. ";

    String polimorfizm = " Полиморфизм выражается в двух условиях ; " +
            "Первое  - Это возможность обращатся с классом - наследником как с предком." +
            "Втрое - Это способность класса - наследника изменять поведение предка "  ;

    String vidimost = "Видимость - это правила, которые определяют из каких частей программы можно обратится " +
            "к пееменной или методу";

    String local_Переменная = "Это переменная которая обьявлена в нутри метода или лока кода. Видемость которой ограничена областью действия метода( и циклы) или блока кода ";



    ////Проф уровень

    String Maven = "1) Мавен - Это фреймворк для  автоматизации сборки проектов. " +
                   "2) Так же мавен позволяет генерировать коркас проекта" +
                   "3) Также позволяет упровлять зависимотсями в нтури проеткта и также загрузать импортом стороних библиотек " +
                    "   ";

}

